PR4/app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos" INNER JOIN "hamburguesas" ON "hamburguesas"."pedido_id" = "pedidos"."id" WHERE "pedidos"."usuario" = ?  [["usuario", "juanmi"]]
---
    def index

        @pedidos = Pedido.joins(:hamburguesas).where(usuario: params[:usuario]).limit(1)

INSERT INTO "hamburguesas" ("pan", "nombre", "tomate", "quesoCabra", "cebolla", "pepinillos", "bacon", "carne", "precio", "pedido_id", "created_at", "updated_at", "lechuga") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "pedidos" ("idPedido", "usuario", "precio", "listo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["idPedido", "009452"], ["usuario", "juanmi"], ["precio", 15.0], ["listo", 0], ["created_at", "2024-05-19 16:37:40.953848"], ["updated_at", "2024-05-19 16:37:40.953848"]]
SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."pedido_id" = ?  [["pedido_id", 81]]
---
    def create
        logger.debug "Received params: #{params.inspect}"
        @pedido = Pedido.new(pedido_params.except(:hamburguesas))
        if @pedido.save
            hamburguesas = []
            errores = []
            pedido_params[:hamburguesas].each do |hamburguesa_params|
                @hamburguesa = Hamburguesa.new(hamburguesa_params)
                @hamburguesa.pedido_id = @pedido.id
                if @hamburguesa.save

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
UPDATE "pedidos" SET "listo" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["listo", 1], ["updated_at", "2024-05-19 16:39:17.306630"], ["id", 40]]
---
    def update
        @pedido = Pedido.find(params[:id])
        if @pedido.update(pedido_params)

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 40]]
---
    def destroy
        @pedido = Pedido.find(params[:id])
        if @pedido.destroy