PR4/app/controllers/pedidos_controller.rb

    def index
        @pedidos = Pedido.where(usuario: params[:usuario])
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."usuario" = ?  [["usuario", "Juanmi"]]

    def update
        @pedido = Pedido.find(params[:id])
        if @pedido.update(pedido_params)
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "pedidos" SET "listo" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["listo", 1], ["updated_at", "2024-05-17 15:44:14.350007"], ["id", 15]]

    def destroy
        @pedido = Pedido.find(params[:id])
        if @pedido.destroy
---
DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 7]]